{
    "educations": [
        {
            "id": "edu-1",
            "school": "Gujarat Technological University",
            "degree": "Bachelors in Computer Engineering",
            "duration": "Jul 2017 - Aug 2021",
            "content": [
                "GPA: 3.63/4",
                "Courses: Data Structures, OOP, Algorithms, Software Engineering, Computer Networks, Operating Systems, Business Analytics, Cloud Computing, Database Management"
            ]
        },
        {
            "id": "edu-2",
            "school": "Gujarat Secondary and Higher Secondary Education Board",
            "degree": "Higher Secondary School",
            "duration": "Jun 2015 - Mar 2017",
            "content": [
                "Percentage: 66/100"
            ]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "AV DEVS solutions",
            "position": "Software Engineer",
            "duration": "Aug 2023 - Oct 2024",
            "description": [
                "Designed and developed dynamic user interfaces, ensuring responsiveness and scalability using modern front-end technologies like React.js and Angular.",
                "Implemented backend services with Java, Spring Boot, and Node.js, focusing on performance optimization and API development.",
                "Deployed backend services using Docker and Kubernetes on Google Cloud, enhancing scalability, fault tolerance, and resource management.",
                "Utilized Agile Scrum methodologies to manage sprint planning, daily stand-ups, and retrospectives, ensuring timely delivery of features and bug fixes.",
                "Collaborated with cross-functional teams to design system architecture, optimize algorithms, and resolve complex performance challenges."

            ]
        },
        {
            "id": "exp-2",
            "company": "Xomic Infotech Pvt. Ltd.",
            "position": "Junior Java Developer",
            "duration": "Aug 2021 - Aug 2023",
            "description": [
                "Developed and maintained robust web applications using Spring Boot, React, and Node.js, ensuring seamless user experiences and efficient performance.",
                "Implemented MVC architecture to improve code organization, maintainability, and scalability, enabling faster development cycles and better team collaboration.",
                "Applied object-oriented programming principles to create modular, reusable code and conducted unit testing using JUnit and Mockito to ensure code quality.",
                "Actively participated in team discussions, sprint reviews, and retrospectives, contributing to continuous process improvements and efficient delivery."
            ]
        },
        {
            "id": "exp-3",
            "company": "Xomic Infotech Pvt. Ltd.",
            "position": "Trainee Java Developer",
            "duration": "Jun 2021 - Aug 2021",
            "description": [
                "Assisted in developing Java-based applications while gaining hands-on experience with Spring Boot and SQL databases.",
                "Learned best coding practices, debugging techniques, and performance optimization strategies to enhance application efficiency.",
                "Collaborated with senior developers on code reviews, troubleshooting, and feature implementation, ensuring quality development."
            ]
        },
        {
            "id": "exp-4",
            "company": "Aegis Softwares",
            "position": "Trainee Java Developer",
            "duration": "Mar 2021 - May 2021",
            "description": [
                "Gained hand-on experience with the  complete software development lifecycle, from planning and design to deployment and maintenance.",
                "Learned industry-standard coding practices and data structure fundamentals, promoting efficient data manipulation and clean, readable code."
            ]
        }
    ],
    "skills": [
        {
            "title": "Programming",
            "tools": [
                "Java",
                "TypeScript",
                "JavaScript",
                "C/C++",
                "NoSQL",
                "SQL",
                "Shell",
                "jQuery",
                "AJAX"
            ]
        },
        {
            "title": "Web",
            "tools": ["React", "Angular 11", "NodeJS", "HTML/CSS", "OAuth", "i18n"]
        },
        {
            "title": "Testing",
            "tools": ["Jest", "JUnit", "Selenium"]
        },
        {
            "title": "Cloud",
            "tools": ["AWS", "Google Cloud"]
        },
        {
            "title": "Databases",
            "tools": ["MongoDB", "MySQL", "Firebase", "PostgeSQL"]
        },
        {
            "title": "OS & Tools",
            "tools": ["MacOS", "Linux", "Git", "Agile (Scrum)", "MVC", "Jenkins", "Docker", "Kubernetes", "JIRA", "Confluence", "Eclipse", "VS Code", "IntelliJ", "Postman", "Swagger"]
        },
        {
            "title": "Microsoft Tools",
            "tools": ["Excel", "PowerPoint", "Word", "Outlook"]
        },
        {
            "title": "Design & Research",
            "tools": [
                "Surveys",
                "Interviews",
                "User Research",
                "Design Strategy",
                "Experience Mapping"
            ]
        }
    ],
    "blog": [
        {
            "id": "blog-1",
            "title": "Why Java Remains a Dominant Backend Technology in 2025",
            "link": "https://medium.com/@koratharsh31/why-java-remains-a-dominant-backend-technology-in-2025-77aa13ff4af4"
        },
        {
            "id": "blog-2",
            "title": "The Power of Cloud Technology: Transforming the Digital Landscape",
            "link": "https://medium.com/@koratharsh31/the-power-of-cloud-technology-transforming-the-digital-landscape-386b7af239c7"
        }
    ]
}
