[
    {
        "id": "other-project-1",
        "title": "E-Post SmartSend",
        "year": "Aug 2019 - Dec 2019",
        "tags": ["NodeJS", "JavaScript", "MongoDB", "JIRA", "Agile", "Java", "Spring Boot", "GCP", "Confluence", "Swagger"],
        "description": "E-Post SmartSend, a secure digital mailbox platform for Swiss Post, using Java and Node.js for backend services and React.js for a responsive frontend. Integrated MongoDB for efficient data storage and Google Cloud Platform (GCP) for scalable cloud deployment and enhanced security. Collaborated with eBill to ensure seamless digital mail delivery, improving user experience and reducing paper dependency.",
        "image": "/portfolio-harsh/assets/other-projects/ePost-SmartSend.webp",
        "jpg": "/portfolio-harsh/assets/other-projects/ePost-SmartSend.jpeg"

    },
    {
        "id": "other-project-2",
        "title": "E-Procurement System (Forward Auction, Reverse Auction, RFQ)",
        "year": "Aug 2019 - Dec 2019",
        "tags": ["Java", "JSP", "Spring MVC", "JavaScript", "MySql", "HTML", "Bootstrap", "JQuery", "JIRA"],
        "description": "Forward Auction: A digital platform where multiple buyers compete to secure items like surplus inventory or used vehicles, reducing time and expanding bidder reach compared to manual processes. Reverse Auction: An online negotiation tool used in the final stage of sourcing to improve procurement efficiency, reduce paperwork, and enhance transparency, helping buyers get better prices while providing vendors with real-time competitiveness feedback. Request For Quotation (RFQ): An electronic tool for buyers to quickly obtain quotes for goods or services, used for initial price discovery before conducting an auction to secure the best market price.",
        "image": "/portfolio-harsh/assets/other-projects/blank.webp",
        "jpg": "/portfolio-harsh/assets/other-projects/blank.jpeg"
    },
    {
        "id": "other-project-3",
        "title": "Placement Selection System",
        "year": "Aug 2019 - Dec 2019",
        "github": "https://github.com/harshkorat/placement-selection-system.git",
        "tags": ["Java", "JSP", "MySql", "HTML", "CSS", "JavaScript", "Bootstrap"],
        "description": "This project automates the selection process activities that the HR Department has to perform prior to and after the actual act of selecting the employees. These activities constitutes tasks like collect Eligible Student details.",
        "readMore": "https://drive.google.com/file/d/1ldkq4tGEMhqDzXKVR2mlGpr0WH0jMCTb/view",
        "image": "/portfolio-harsh/assets/other-projects/blank.webp",
        "jpg": "/portfolio-harsh/assets/other-projects/blank.jpeg"
    }
]
